<?php

namespace Database\Seeders;

use App\Models\City;
use Illuminate\Database\Seeder;

class CitySeeder extends Seeder
{
    public function run(): void
    {
        $cities = ['რეგიონი', 'თბილისი',	'ბათუმი',	'რუსთავი',	'ქუთაისი',	'გორი',	'ფოთი',	'ზუგდიდი',	'მარნეული',	'ხაშური',	'სამტრედია', 'ზესტაფონი',	'თელავი',	'ქობულეთი', 'ახალციხე', 'სენაკი',	'ოზურგეთი',	'კასპი',	'ჭიათურა',	'გარდაბანი', 'ბორჯომი',	'საგარეჯო',	'ყვარელი',	'ბოლნისი',	'ტყიბული',	'ხონი',	'წყალტუბო', 'ახალქალაქი',	'მცხეთა',	'გურჯაანი',	'დუშეთი',	'ქარელი',	'ლანჩხუთი',	'ახმეტა',	'ლაგოდეხი', 'საჩხერე',	'დედოფლისწყარო',	'ვალე',	'თერჯოლა',	'წნორი', 'თეთრიწყარო',	'აბაშა', 'მარტვილი', 'ნინოწმინდა',	'წალკა', 'ვანი', 'ხობი', 'დმანისი',	'წალენჯიხა', 'ბაღდათი',	'ონი',	'ჩხოროწყუ',	'ამბროლაური',	'სიღნაღი',	'ჯვარი', 'ცაგერი'];
        foreach ($cities as $city) {
            City::create([
                'name' => $city,
            ]);
        }
    }
}
